01  WS-DATA-AREA. 
    05  WS-NUMBER PIC 9(5) VALUE 99999. 
    05  WS-AMOUNT PIC 9(7)V99 VALUE 99999.99. 
    05 WS-NUMBER-OVERFLOW-FLAG PIC 9 VALUE 0. 
    05 WS-AMOUNT-OVERFLOW-FLAG PIC 9 VALUE 0. 

       PROCEDURE DIVISION.
           ADD 1 TO WS-NUMBER ON SIZE ERROR MOVE 1 TO WS-NUMBER-OVERFLOW-FLAG
           IF WS-NUMBER-OVERFLOW-FLAG = 1 THEN 
               DISPLAY "NUMBER EXCEEDS THE LIMIT" 
           END-IF
           DISPLAY WS-NUMBER
           ADD 1 TO WS-AMOUNT ON SIZE ERROR MOVE 1 TO WS-AMOUNT-OVERFLOW-FLAG
           IF WS-AMOUNT-OVERFLOW-FLAG = 1 THEN 
               DISPLAY "AMOUNT EXCEEDS THE LIMIT" 
           END-IF
           DISPLAY WS-AMOUNT
           STOP RUN.